using System;

namespace CSharpBasic
{
    /*
     *  Реализовать связный список: создание, удаление, добавление произвольных элементов, реверс списка - без использования стандартных коллекций/LINQ (только IEnumerable)
     *   Реализовать бинарное дерево: заполнение, поиск, удаление элемента - без использования стандартных деревьев
     *  Реализовать сортировку вставками - без .OrderBy() :)
     *
     */
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}